Autodesk.Revit.DB.AttachmentType
Enum determining whether a link is an attachment or an overlay
Since:
2012
Since:
2012

Autodesk.Revit.DB.AttachmentType.Attachment
The link is an attachment. If the host file is linked into
another file, the link will also be brought along.

Autodesk.Revit.DB.AttachmentType.Overlay
The link is an overlay, only meant to be seen in this file.
If the host is linked into another file, the link will not
be brought along.